src/app/controllers/locations_controller.rb

INSERT INTO "locations" ("address", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "123 Example Street"], ["latitude", 1.0], ["longitude", 1.0], ["created_at", "2020-04-26 20:57:06.621426"], ["updated_at", "2020-04-26 20:57:06.621426"]]
---
  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save