src/app/controllers/reports_controller.rb

INSERT INTO "reports" ("numPeople", "comments", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["numPeople", 1], ["comments", "No"], ["created_at", "2020-04-27 12:42:42.470190"], ["updated_at", "2020-04-27 12:42:42.470190"]]
---
  def create
    @report = Report.new(report_params)

    respond_to do |format|
      if @report.save

DELETE FROM "reports" WHERE "reports"."id" = ?  [["id", 4]]
---
  def destroy
    @report.destroy